#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <time.h>

// 중복 체크 함수
int check_duplicate(int arr[], int size, int num)
{

}




int main() {
printf("******************************");
printf("<중간프로젝트2>");
printf("학번 : 2020XXXXX, 이름 : 홍길동");
printf("백화점에서 물건을 구매하십시오.");
printf("TV의 가격은 20만원이며 응모 기회는 10번 주어집니다.");
printf("냉장고의 가격은 10만원이며 응모 기회는 5번 주어집니다.");
printf("청소기의 가격은 5만원이며 응모 기회는 2번 주어집니다.");
printf("오븐의 가격은 1만원이며 응모 기회는 1번 주어집니다.");
printf("당신의 현재 보유 자금은?(x만원) : "); // 프로그램 안내 메시지


printf("무엇을 구매하시겠습니까?");
printf("1.TV 2.냉장고 3.청소기 4.오븐 5.구입을 멈춘다"); // "물건 구입 메뉴"

// 1~4 메뉴 선택 시, 각 물건을 A라 하면 "내가 구매할 A의 개수는? : " 출력 이후 "잔돈은 n만원입니다" 출력

// 잔돈을 초과하여 구매 시 "보유한 자금을 %d만원만큼 초과하였습니다." 출력
// 이후 해당 물건의 구매 가능 개수가 0개이면 "현재 잔돈은 n만원이며, A는 더 이상 구매할 수 없습니다." 출력, 구매가능 개수가 x개이면 "현재 잔돈은 n만원이며, A는 x개 이하로 구매할 수 있습니다." 출력 이후 다시 "물건 구입 메뉴" 출력

// 5.구입을 멈춘다 선택 시 "더 이상 물건을 사지 않습니다", "경품 응모를 시작합니다" 출력 이후 "경품 응모 단계"로 넘어감

// 1~5 외의 메뉴 선택 시 "잘못된 선택입니다. 다시 선택해주세요" 출력 후 다시 "물건 구입 메뉴" 출력








// "경품 응모 단계"

// "내 응모 기회는 : %d" 출력




printf("경품 응모 번호는 : "); // 중복되지 않는 랜덤 경품 응모 번호 출력





printf("경품 당첨 번호는 : "); // 중복되지 않는 랜덤 경품 당첨 번호 출력



// "일치하는 번호 개수: %d개" 출력
// "당신의 등수: %d등" 출력


return 0;
}
